package javaexamples;

public class Demo2 {
	// Пример 2. Использование комментариев
	// Эта программа ничего не делает и ничего не выводит на экран, 
	// так как ее текст состоит только из комментариев. 
	// Все комментарии игнорируются компилятором как пустое место!
	
	public static void main(String[] args) {	
		// это однострочный комментарий

		/* это многострочный комментарий 
		он может содержать 
		произвольное число строк текста */

		// закомментированные строки кода игнорируются компилятором
    	//Console.write("Hello World!"); // закомментированная строка кода		
	}
}

