package javaexamples;

public class Demo4 {
	// ѕример 4. ѕеременные и литералы
	// эта программа демонстрирует объ€вление переменных и присваивание им начальных значений

	public static void main(String[] args) {

		int a = -10;	// объ€влена целочисленна€ переменна€ a, начальное значение -10 
		double b = 3.14; // объ€влена вещественна€ переменна€ b, начальное значение 3,14
		boolean c = true; // объ€влена булевска€ переменна€ c, начальное значение true (»—“»ЌЌќ)
		boolean d = false; // объ€влена булевска€ переменна€ d, начальное значение false (Ћќ∆Ќќ)

		Console.println("a = " + a); // вывод текста "a=" и текущего значени€ переменной a
		Console.println("b = " + b); // вывод текста "b=" и текущего значени€ переменной b
		Console.println("c = " + c); // вывод текста "c=" и текущего значени€ переменной c
		Console.println("d = " + d); // вывод текста "d=" и текущего значени€ переменной d
	}
}

